FV2310/E_1006.dot
digraph D {
    labelloc="t";
    label=<<B><FONT POINT-SIZE="18">Sperrprozesse Gas</FONT></B><BR/><BR/><B><FONT POINT-SIZE="16">19.5.2: E_1006_Stornierung prüfen (Basiert auf Strom EBD: E_0468_Stornierung prüfen)</FONT></B><BR/><BR/><BR/><BR/>>;
    "Start" [margin="0.2,0.12", shape=box, style=filled, fillcolor="#7a8da1", label=<<B>E_1006</B><BR align="center"/><FONT point-size="12"><B><U>Prüfende Rolle:</U> NB</B></FONT><BR align="center"/>>];
    "10" [margin="0.2,0.12", shape=box, style="filled,rounded", fillcolor="#7aab8a", label=<<B>10: </B>Wurde der Sperr- / Entsperrauftrag bereits durch den NB abgelehnt?<BR align="left"/>>];
    "A06" [margin="0.17,0.08", shape=box, style=filled, fillcolor="#cfb986", label=<<B>A06</B><BR align="center"/><FONT point-size="12"><U>Hinweis:</U><BR align="left"/>Cluster: Ablehnung<BR align="left"/>Auftrag wurde bereits abgelehnt und kann nicht mehr storniert werden<BR align="left"/></FONT>>];
    "20" [margin="0.2,0.12", shape=box, style="filled,rounded", fillcolor="#7aab8a", label=<<B>20: </B>Handelt es sich um eine Stornierung eines Entsperrauftrags?<BR align="left"/>>];
    "30" [margin="0.2,0.12", shape=box, style="filled,rounded", fillcolor="#7aab8a", label=<<B>30: </B>Ist die Stornierung vor der Durchführung der Entsperrung eingegangen?<BR align="left"/>>];
    "A01" [margin="0.17,0.08", shape=box, style=filled, fillcolor="#cfb986", label=<<B>A01</B><BR align="center"/><FONT point-size="12"><U>Hinweis:</U><BR align="left"/>Cluster: Zustimmung<BR align="left"/>Entsperrauftrag ist storniert.<BR align="left"/></FONT>>];
    "A02" [margin="0.17,0.08", shape=box, style=filled, fillcolor="#cfb986", label=<<B>A02</B><BR align="center"/><FONT point-size="12"><U>Hinweis:</U><BR align="left"/>Cluster: Ablehnung<BR align="left"/>Stornierung des Entsperrauftrags nicht mehr möglich.<BR align="left"/></FONT>>];
    "40" [margin="0.2,0.12", shape=box, style="filled,rounded", fillcolor="#7aab8a", label=<<B>40: </B>Ist der Nachrichteneingang der Stornierung spätestens am Tag vor dem vom NB geplanten Ausführungstermin bzw. fixen Sperrtermin aus dem Sperrauftrag eingegangen?<BR align="left"/>>];
    "A03" [margin="0.17,0.08", shape=box, style=filled, fillcolor="#cfb986", label=<<B>A03</B><BR align="center"/><FONT point-size="12"><U>Hinweis:</U><BR align="left"/>Cluster: Zustimmung<BR align="left"/>Sperrauftrag ist bis zum Vortag der Sperrung storniert.<BR align="left"/></FONT>>];
    "50" [margin="0.2,0.12", shape=box, style="filled,rounded", fillcolor="#7aab8a", label=<<B>50: </B>Ist die Stornierung vor der Durchführung der Sperrung eingegangen?<BR align="left"/>>];
    "A04" [margin="0.17,0.08", shape=box, style=filled, fillcolor="#cfb986", label=<<B>A04</B><BR align="center"/><FONT point-size="12"><U>Hinweis:</U><BR align="left"/>Cluster: Zustimmung<BR align="left"/>Sperrauftrag ist am Tag der Sperrung storniert.<BR align="left"/></FONT>>];
    "A05" [margin="0.17,0.08", shape=box, style=filled, fillcolor="#cfb986", label=<<B>A05</B><BR align="center"/><FONT point-size="12"><U>Hinweis:</U><BR align="left"/>Cluster: Ablehnung<BR align="left"/>Stornierung des Sperrauftrags nicht mehr möglich.<BR align="left"/></FONT>>];

    "Start" -> "10";
    "10" -> "A06" [label="Ja"];
    "10" -> "20" [label="Nein"];
    "20" -> "30" [label="Ja"];
    "20" -> "40" [label="Nein"];
    "30" -> "A01" [label="Ja"];
    "30" -> "A02" [label="Nein"];
    "40" -> "A03" [label="Ja"];
    "40" -> "50" [label="Nein"];
    "50" -> "A04" [label="Ja"];
    "50" -> "A05" [label="Nein"];

    bgcolor="transparent";
}
